jiwook021/pSoC-RTOS/Virtual_MQTT/proj_cm4/source/mqtt_task.c
/******************************************************************************
* Function Prototypes
*******************************************************************************/
static cy_rslt_t wifi_connect(void);
static cy_rslt_t mqtt_init(void);
static cy_rslt_t mqtt_connect(void);
static void vcm_callback(cy_vcm_event_t event);
static void mqtt_event_callback(cy_mqtt_t mqtt_handle, cy_mqtt_event_t event, void *user_data);
static void cleanup(void);
void print_heap_usage(char *msg);

#if GENERATE_UNIQUE_CLIENT_ID
static cy_rslt_t mqtt_get_unique_client_identifier(char *mqtt_client_identifier);
#endif /* GENERATE_UNIQUE_CLIENT_ID */

/******************************************************************************
 * Function Name: mqtt_client_task
 ******************************************************************************
 * Summary:
 *  Task for handling initialization & connection of Wi-Fi and the MQTT client.
 *  The task also creates and manages the subscriber and publisher tasks upon 
 *  successful MQTT connection. The task also handles the WiFi and MQTT 
 *  connections by initiating reconnection on the event of disconnections.
 *
 * Parameters:
 *  void *pvParameters : Task parameter defined during task creation (unused)
 *
 * Return:
 *  void
 ******************************************************************************/
void mqtt_client_task(void *pvParameters)
{
    cy_rslt_t result;

    /* Structures that store the data to be sent/received to/from various
     * message queues.
     */
    mqtt_task_cmd_t mqtt_status;
    subscriber_data_t subscriber_q_data;
    publisher_data_t publisher_q_data;

    /* Configure the Wi-Fi interface as a Wi-Fi STA (i.e. Client). */
    cy_wcm_config_t config = {.interface = CY_WCM_INTERFACE_TYPE_STA};

    /* To avoid compiler warnings */
    (void) pvParameters;

    /* Create a message queue to communicate with other tasks and callbacks. */
    mqtt_task_q = xQueueCreate(MQTT_TASK_QUEUE_LENGTH, sizeof(mqtt_task_cmd_t));

    /* Initialize the Wi-Fi Connection Manager and jump to the cleanup block 
     * upon failure.
     */
    if (CY_RSLT_SUCCESS != cy_wcm_init(&config))
    {
        printf("\nWi-Fi Connection Manager initialization failed!\n");
        goto exit_cleanup;
    }

    /* Set the appropriate bit in the status_flag to denote successful 
     * WCM initialization.
     */
    status_flag |= WCM_INITIALIZED;
    printf("\nWi-Fi Connection Manager initialized.\n");

    /* Initiate connection to the Wi-Fi AP and cleanup if the operation fails. */
    if (CY_RSLT_SUCCESS != wifi_connect())
    {
        goto exit_cleanup;
    }

    /* Set-up the MQTT client and connect to the MQTT broker. Jump to the 
     * cleanup block if any of the operations fail.
     */
    if ( (CY_RSLT_SUCCESS != mqtt_init()) || (CY_RSLT_SUCCESS != mqtt_connect()) )
    {
        goto exit_cleanup;
    }

    /* VCM configuration for primary connectivity core (CM4) */
    cy_vcm_config_t primary_core_config;
    primary_core_config.hal_resource_opt = CY_VCM_USE_HAL_RESOURCE;
    primary_core_config.channel_num = CYHAL_IPC_CHAN_0;
    primary_core_config.event_cb = vcm_callback;
    result= cy_vcm_init(&primary_core_config);

    /* VCM Initialization failed. Stop program execution */
    if (result != CY_RSLT_SUCCESS)
    {
        printf("\nVCM Initialization failed on CM4.\r\n");
        CY_ASSERT(0);
    }
    else
    {
        printf("\nVirtual Connectivity Manager Initialized on CM4\n");
        init_done = 1;
    }

    /* Create the subscriber task and cleanup if the operation fails. */
    if (pdPASS != xTaskCreate(subscriber_task, "Subscriber task", SUBSCRIBER_TASK_STACK_SIZE,
                              NULL, SUBSCRIBER_TASK_PRIORITY, &subscriber_task_handle))
    {
        printf("Failed to create the Subscriber task!\n");
        goto exit_cleanup;
    }

    /* Wait for the subscribe operation to complete. */
    vTaskDelay(pdMS_TO_TICKS(TASK_CREATION_DELAY_MS));

    /* Create the publisher task and cleanup if the operation fails. */
    if (pdPASS != xTaskCreate(publisher_task, "Publisher task", PUBLISHER_TASK_STACK_SIZE, 
                              NULL, PUBLISHER_TASK_PRIORITY, &publisher_task_handle))
    {
        printf("Failed to create Publisher task!\n");
        goto exit_cleanup;
    }

    print_heap_usage("mqtt_client_task: subscriber & publisher tasks created\n");

    while (true)
    {
        /* Wait for results of MQTT operations from other tasks and callbacks. */
        if (pdTRUE == xQueueReceive(mqtt_task_q, &mqtt_status, portMAX_DELAY))
        {
            /* In this code example, the disconnection from the MQTT Broker or 
             * the Wi-Fi network is handled by the case 'HANDLE_DISCONNECTION'. 
             * 
             * The publish and subscribe failures (`HANDLE_MQTT_PUBLISH_FAILURE`
             * and `HANDLE_MQTT_SUBSCRIBE_FAILURE`) does not initiate 
             * reconnection in this example, but they can be handled as per the 
             * application requirement in the following swich cases.
             */
            switch(mqtt_status)
            {
                case HANDLE_MQTT_PUBLISH_FAILURE:
                {
                    /* Handle Publish Failure here. */
                    break;
                }

                case HANDLE_MQTT_SUBSCRIBE_FAILURE:
                {
                    /* Handle Subscribe Failure here. */
                    break;
                }

                case HANDLE_DISCONNECTION:
                {
                    /* Deinit the publisher before initiating reconnections. */
                    publisher_q_data.cmd = PUBLISHER_DEINIT;
                    xQueueSend(publisher_task_q, &publisher_q_data, portMAX_DELAY);

                    /* Although the connection with the MQTT Broker is lost, 
                     * call the MQTT disconnect API for cleanup of threads and 
                     * other resources before reconnection.
                     */
                    result = cy_mqtt_disconnect(mqtt_connection);
                    if(CY_RSLT_SUCCESS != result)
                    {
                        printf("\nMQTT diconnection failed on CM4.\r\n");
                        CY_ASSERT(0);
                    }                   
                    /* Check if Wi-Fi connection is active. If not, update the 
                     * status flag and initiate Wi-Fi reconnection.
                     */
                    if (0 == cy_wcm_is_connected_to_ap())
                    {
                        status_flag &= ~(WIFI_CONNECTED);
                        printf("\nInitiating Wi-Fi Reconnection...\n");
                        if (CY_RSLT_SUCCESS != wifi_connect())
                        {
                            goto exit_cleanup;
                        }
                    }

                    printf("\nInitiating MQTT Reconnection...\n");
                    if (CY_RSLT_SUCCESS != mqtt_connect())
                    {
                        goto exit_cleanup;
                    }

                    /* Initiate MQTT subscribe post the reconnection. */
                    subscriber_q_data.cmd = SUBSCRIBE_TO_TOPIC;
                    xQueueSend(subscriber_task_q, &subscriber_q_data, portMAX_DELAY);

                    /* Initialize Publisher post the reconnection. */
                    publisher_q_data.cmd = PUBLISHER_INIT;
                    xQueueSend(publisher_task_q, &publisher_q_data, portMAX_DELAY);
                    break;
                }

                default:
                    break;
            }
        }
    }

    /* Cleanup section: Delete subscriber and publisher tasks and perform
     * cleanup for various operations based on the status_flag.
     */
    exit_cleanup:
    printf("\nTerminating Publisher and Subscriber tasks...\n");
    if (subscriber_task_handle != NULL)
    {
        vTaskDelete(subscriber_task_handle);
    }
    if (publisher_task_handle != NULL)
    {
        vTaskDelete(publisher_task_handle);
    }
    cleanup();
    printf("\nCleanup Done\nTerminating the MQTT task...\n\n");
    vTaskDelete(NULL);
}

